{
  "<UNK>": 0,
  "002": 1,
  "006": 2,
  "009": 3,
  "010": 4,
  "011": 5,
  "012": 6,
  "013": 7,
  "014": 8,
  "015": 9,
  "016": 10,
  "017": 11,
  "018": 12,
  "019": 13,
  "020": 14,
  "021": 15,
  "022": 16,
  "023": 17,
  "024": 18,
  "025": 19,
  "026": 20,
  "027": 21,
  "028": 22,
  "029": 23,
  "030": 24,
  "031": 25,
  "032": 26,
  "033": 27,
  "034": 28,
  "035": 29,
  "036": 30,
  "037": 31,
  "038": 32,
  "039": 33,
  "040": 34,
  "041": 35,
  "042": 36,
  "043": 37,
  "044": 38,
  "045": 39,
  "048": 40,
  "049": 41,
  "050": 42,
  "052": 43,
  "053": 44,
  "054": 45,
  "056": 46,
  "060": 47,
  "061": 48,
  "062": 49,
  "063": 50,
  "064": 51,
  "065": 52,
  "066": 53,
  "067": 54,
  "068": 55,
  "069": 56,
  "070": 57,
  "073": 58,
  "074": 59,
  "075": 60,
  "076": 61,
  "077": 62,
  "078": 63,
  "079": 64,
  "080": 65,
  "081": 66,
  "082": 67,
  "083": 68,
  "084": 69,
  "085": 70,
  "087": 71,
  "088": 72,
  "089": 73,
  "090": 74,
  "091": 75,
  "095": 76,
  "098": 77,
  "100": 78,
  "101": 79,
  "103": 80,
  "104": 81,
  "105": 82,
  "106": 83,
  "107": 84,
  "108": 85,
  "109": 86,
  "110": 87,
  "111": 88,
  "112": 89,
  "113": 90,
  "114": 91,
  "115": 92,
  "117": 93,
  "118": 94,
  "119": 95,
  "120": 96,
  "121": 97,
  "122": 98,
  "123": 99,
  "124": 100,
  "125": 101,
  "126": 102,
  "127": 103,
  "128": 104,
  "129": 105,
  "130": 106,
  "131": 107,
  "132": 108,
  "133": 109,
  "134": 110,
  "135": 111,
  "136": 112,
  "137": 113,
  "139": 114,
  "140": 115,
  "141": 116,
  "142": 117,
  "143": 118,
  "144": 119,
  "145": 120,
  "146": 121,
  "147": 122,
  "148": 123,
  "149": 124,
  "150": 125,
  "151": 126,
  "152": 127,
  "153": 128,
  "157": 129,
  "158": 130,
  "159": 131,
  "161": 132,
  "163": 133,
  "165": 134,
  "166": 135,
  "168": 136,
  "170": 137,
  "171": 138,
  "173": 139,
  "174": 140,
  "175": 141,
  "176": 142,
  "177": 143,
  "178": 144,
  "179": 145,
  "180": 146,
  "181": 147,
  "182": 148,
  "183": 149,
  "186": 150,
  "189": 151,
  "190": 152,
  "191": 153,
  "193": 154,
  "194": 155,
  "195": 156,
  "196": 157,
  "197": 158,
  "198": 159,
  "199": 160,
  "200": 161,
  "201": 162,
  "202": 163,
  "206": 164,
  "207": 165,
  "208": 166,
  "209": 167,
  "210": 168,
  "211": 169,
  "212": 170,
  "214": 171,
  "215": 172,
  "217": 173,
  "220": 174,
  "221": 175,
  "222": 176,
  "223": 177,
  "224": 178,
  "226": 179,
  "228": 180,
  "229": 181,
  "230": 182,
  "231": 183,
  "232": 184,
  "234": 185,
  "235": 186,
  "236": 187,
  "240": 188,
  "241": 189,
  "242": 190,
  "244": 191,
  "245": 192,
  "253": 193,
  "258": 194,
  "261": 195,
  "262": 196,
  "263": 197,
  "265": 198,
  "270": 199,
  "271": 200,
  "272": 201,
  "273": 202,
  "274": 203,
  "275": 204,
  "276": 205,
  "277": 206,
  "279": 207,
  "280": 208,
  "281": 209,
  "282": 210,
  "283": 211,
  "284": 212,
  "285": 213,
  "286": 214,
  "287": 215,
  "288": 216,
  "290": 217,
  "291": 218,
  "292": 219,
  "293": 220,
  "294": 221,
  "296": 222,
  "297": 223,
  "299": 224,
  "300": 225,
  "301": 226,
  "302": 227,
  "303": 228,
  "305": 229,
  "306": 230,
  "307": 231,
  "309": 232,
  "310": 233,
  "312": 234,
  "313": 235,
  "314": 236,
  "316": 237,
  "318": 238,
  "319": 239,
  "320": 240,
  "321": 241,
  "322": 242,
  "323": 243,
  "324": 244,
  "325": 245,
  "326": 246,
  "327": 247,
  "328": 248,
  "329": 249,
  "330": 250,
  "331": 251,
  "333": 252,
  "334": 253,
  "335": 254,
  "336": 255,
  "337": 256,
  "338": 257,
  "339": 258,
  "341": 259,
  "342": 260,
  "345": 261,
  "346": 262,
  "347": 263,
  "349": 264,
  "351": 265,
  "352": 266,
  "354": 267,
  "358": 268,
  "360": 269,
  "361": 270,
  "362": 271,
  "363": 272,
  "368": 273,
  "370": 274,
  "371": 275,
  "372": 276,
  "373": 277,
  "376": 278,
  "377": 279,
  "378": 280,
  "379": 281,
  "380": 282,
  "381": 283,
  "382": 284,
  "383": 285,
  "385": 286,
  "386": 287,
  "391": 288,
  "392": 289,
  "394": 290,
  "395": 291,
  "396": 292,
  "397": 293,
  "400": 294,
  "402": 295,
  "404": 296,
  "405": 297,
  "406": 298,
  "410": 299,
  "411": 300,
  "417": 301,
  "420": 302,
  "421": 303,
  "424": 304,
  "425": 305,
  "427": 306,
  "430": 307,
  "431": 308,
  "432": 309,
  "433": 310,
  "434": 311,
  "435": 312,
  "436": 313,
  "437": 314,
  "440": 315,
  "441": 316,
  "442": 317,
  "443": 318,
  "444": 319,
  "445": 320,
  "446": 321,
  "447": 322,
  "449": 323,
  "450": 324,
  "451": 325,
  "452": 326,
  "453": 327,
  "454": 328,
  "455": 329,
  "456": 330,
  "457": 331,
  "458": 332,
  "459": 333,
  "460": 334,
  "461": 335,
  "462": 336,
  "463": 337,
  "465": 338,
  "466": 339,
  "467": 340,
  "468": 341,
  "469": 342,
  "471": 343,
  "472": 344,
  "473": 345,
  "474": 346,
  "477": 347,
  "479": 348,
  "480": 349,
  "481": 350,
  "482": 351,
  "483": 352,
  "484": 353,
  "485": 354,
  "486": 355,
  "487": 356,
  "488": 357,
  "489": 358,
  "490": 359,
  "492": 360,
  "493": 361,
  "494": 362,
  "495": 363,
  "496": 364,
  "497": 365,
  "498": 366,
  "500": 367,
  "501": 368,
  "502": 369,
  "503": 370,
  "504": 371,
  "505": 372,
  "506": 373,
  "511": 374,
  "515": 375,
  "520": 376,
  "521": 377,
  "522": 378,
  "523": 379,
  "524": 380,
  "525": 381,
  "527": 382,
  "528": 383,
  "530": 384,
  "531": 385,
  "532": 386,
  "534": 387,
  "535": 388,
  "537": 389,
  "538": 390,
  "539": 391,
  "540": 392,
  "542": 393,
  "543": 394,
  "544": 395,
  "546": 396,
  "547": 397,
  "548": 398,
  "549": 399,
  "550": 400,
  "551": 401,
  "553": 402,
  "554": 403,
  "555": 404,
  "556": 405,
  "557": 406,
  "558": 407,
  "559": 408,
  "560": 409,
  "561": 410,
  "562": 411,
  "563": 412,
  "564": 413,
  "565": 414,
  "567": 415,
  "570": 416,
  "571": 417,
  "573": 418,
  "577": 419,
  "580": 420,
  "581": 421,
  "582": 422,
  "583": 423,
  "584": 424,
  "585": 425,
  "586": 426,
  "587": 427,
  "590": 428,
  "594": 429,
  "596": 430,
  "597": 431,
  "598": 432,
  "600": 433,
  "601": 434,
  "602": 435,
  "603": 436,
  "604": 437,
  "605": 438,
  "606": 439,
  "607": 440,
  "609": 441,
  "610": 442,
  "612": 443,
  "613": 444,
  "615": 445,
  "616": 446,
  "617": 447,
  "618": 448,
  "619": 449,
  "620": 450,
  "622": 451,
  "623": 452,
  "625": 453,
  "626": 454,
  "627": 455,
  "629": 456,
  "630": 457,
  "631": 458,
  "633": 459,
  "635": 460,
  "640": 461,
  "641": 462,
  "644": 463,
  "648": 464,
  "649": 465,
  "650": 466,
  "652": 467,
  "654": 468,
  "655": 469,
  "657": 470,
  "658": 471,
  "660": 472,
  "662": 473,
  "665": 474,
  "666": 475,
  "667": 476,
  "670": 477,
  "672": 478,
  "673": 479,
  "674": 480,
  "678": 481,
  "680": 482,
  "681": 483,
  "685": 484,
  "693": 485,
  "700": 486,
  "701": 487,
  "704": 488,
  "705": 489,
  "707": 490,
  "708": 491,
  "711": 492,
  "713": 493,
  "717": 494,
  "720": 495,
  "721": 496,
  "722": 497,
  "723": 498,
  "726": 499,
  "727": 500,
  "728": 501,
  "729": 502,
  "730": 503,
  "731": 504,
  "735": 505,
  "737": 506,
  "740": 507,
  "741": 508,
  "743": 509,
  "744": 510,
  "746": 511,
  "750": 512,
  "751": 513,
  "752": 514,
  "756": 515,
  "757": 516,
  "758": 517,
  "760": 518,
  "761": 519,
  "762": 520,
  "763": 521,
  "764": 522,
  "765": 523,
  "767": 524,
  "769": 525,
  "770": 526,
  "772": 527,
  "773": 528,
  "774": 529,
  "775": 530,
  "776": 531,
  "777": 532,
  "778": 533,
  "780": 534,
  "781": 535,
  "782": 536,
  "784": 537,
  "786": 538,
  "787": 539,
  "789": 540,
  "790": 541,
  "791": 542,
  "793": 543,
  "794": 544,
  "796": 545,
  "797": 546,
  "799": 547,
  "800": 548,
  "801": 549,
  "802": 550,
  "803": 551,
  "804": 552,
  "805": 553,
  "806": 554,
  "809": 555,
  "810": 556,
  "811": 557,
  "812": 558,
  "813": 559,
  "815": 560,
  "816": 561,
  "820": 562,
  "826": 563,
  "830": 564,
  "833": 565,
  "834": 566,
  "836": 567,
  "837": 568,
  "838": 569,
  "840": 570,
  "841": 571,
  "843": 572,
  "847": 573,
  "850": 574,
  "852": 575,
  "853": 576,
  "856": 577,
  "857": 578,
  "860": 579,
  "863": 580,
  "867": 581,
  "870": 582,
  "871": 583,
  "875": 584,
  "878": 585,
  "880": 586,
  "881": 587,
  "890": 588,
  "891": 589,
  "894": 590,
  "895": 591,
  "900": 592,
  "902": 593,
  "904": 594,
  "905": 595,
  "906": 596,
  "907": 597,
  "908": 598,
  "910": 599,
  "911": 600,
  "912": 601,
  "913": 602,
  "914": 603,
  "915": 604,
  "916": 605,
  "917": 606,
  "919": 607,
  "920": 608,
  "921": 609,
  "922": 610,
  "923": 611,
  "924": 612,
  "925": 613,
  "926": 614,
  "927": 615,
  "928": 616,
  "929": 617,
  "930": 618,
  "931": 619,
  "933": 620,
  "934": 621,
  "935": 622,
  "936": 623,
  "937": 624,
  "939": 625,
  "940": 626,
  "941": 627,
  "942": 628,
  "943": 629,
  "944": 630,
  "945": 631,
  "946": 632,
  "947": 633,
  "948": 634,
  "949": 635,
  "950": 636,
  "951": 637,
  "952": 638,
  "953": 639,
  "954": 640,
  "955": 641,
  "956": 642,
  "957": 643,
  "958": 644,
  "959": 645,
  "960": 646,
  "961": 647,
  "965": 648,
  "966": 649,
  "967": 650,
  "968": 651,
  "969": 652,
  "970": 653,
  "971": 654,
  "972": 655,
  "973": 656,
  "974": 657,
  "975": 658,
  "977": 659,
  "978": 660,
  "980": 661,
  "981": 662,
  "982": 663,
  "983": 664,
  "984": 665,
  "985": 666,
  "986": 667,
  "987": 668,
  "988": 669,
  "989": 670,
  "990": 671,
  "991": 672,
  "992": 673,
  "993": 674,
  "995": 675,
  "997": 676,
  "998": 677,
  "999": 678
}